function HomePage() {
	return (
		<>
			<h1 className="mb-4 text-3xl text-center">Cайт для планування подорожі</h1>
			<p>
				<strong>Завдання:</strong> На одній сторінці знаходиться перелік автобусів, на другій сторінці вибираємо готелі. Вибрати можна декілька автобусів і готелів (тоді турфірма самостійно вибере один доступних і вибраних вами) . На третій відображаємо результати вибору з попередніх сторінок (список вибраних автобусів і готелів) (тут можна видалити деякі автобуси чи готелі). Тут бекенд не використовуємо а константні дані.
			</p>
			<p className="mt-3">
				<strong>Завдання 2:</strong> Використовуючи context зробити можливість передачі теми у компоненти додатку
			</p>
		</>
	);
}

export default HomePage;
